app/controllers/pages_controller.rb

  def index
      @podcasts = Podcast.all
---
SELECT "podcasts".* FROM "podcasts"  ORDER BY "podcasts"."created_at" DESC